{
  "backend/main.mo": "Main Motoko actor for the FUSION GEAR backend, implementing user profiles, customer profiles, service records, and invoice management with role-based access control via mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing four frontend source files: App.tsx, DashboardPage, CustomerProfilePage, and ServiceHistoryPage, describing their roles and recent fixes.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark theme CSS custom properties for colors, borders, charts, and sidebar.",
  "frontend/index.html": "HTML entry point for the FUSION GEAR frontend app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (dashboard, customers, billing, invoices, history, login, profile setup) and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that shows a loading spinner, login prompt, or profile setup modal depending on the user's Internet Identity authentication and profile state.",
  "frontend/src/components/CustomerForm.tsx": "Form component for creating or editing a customer profile, including fields for name, phone, address, bike details, and fuel level, with create/update mutations and toast notifications.",
  "frontend/src/components/Layout.tsx": "App shell layout component providing a sticky header with logo, desktop/mobile navigation, and login/logout controls, wrapping page content in an AuthGuard.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter their name and save their profile before accessing the app.",
  "frontend/src/components/ThermalPrintSection.tsx": "Renders a thermal receipt preview with 58mm/80mm paper width toggle, and provides copy-to-clipboard and browser print functionality for invoices.",
  "frontend/src/components/WhatsAppShareButton.tsx": "Renders a WhatsApp share button that composes a formatted service invoice message and opens a wa.me link to send it to the customer's phone number.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for CRUD operations on user profiles, customers, invoices, and service records against the ICP backend actor.",
  "frontend/src/index.css": "Defines global styles including a dark mechanical theme with OKLCH CSS variables, Tailwind imports, and custom utility classes for amber accents and touch targets.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CreateBillPage.tsx": "Page component with a form for creating a new service invoice, supporting customer selection, service type checkboxes, cost inputs, GST toggle, and live billing calculation before submission.",
  "frontend/src/pages/CustomerProfilePage.tsx": "Displays a searchable list of customer profiles with options to add, edit, delete, and navigate to create a bill for each customer. Uses query hooks for data fetching and renders a form dialog for create/edit operations.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing daily/monthly sales totals, pending invoices, service frequency stats, and quick-action links to create bills or view customers. Fetches data via multiple query hooks and displays loading skeletons.",
  "frontend/src/pages/InvoiceViewPage.tsx": "Displays a detailed view of a single invoice including customer info, services rendered, and payment status, with actions to mark as paid, download PDF, share via WhatsApp, or print thermally.",
  "frontend/src/pages/LoginPage.tsx": "Login page for the FUSION GEAR app that authenticates users via Internet Identity, showing app features and redirecting to the dashboard upon successful login.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Simple page that centers and renders the ProfileSetupModal component for initial user profile configuration.",
  "frontend/src/pages/ServiceHistoryPage.tsx": "Allows searching service history by bike registration number, displaying a sorted list of past invoices with expandable details for each record.",
  "frontend/src/utils/billingCalculations.ts": "Provides utility functions for calculating billing totals (with GST, discounts, labour, and spare parts), formatting currency in INR, formatting nanosecond timestamps, and extracting service name labels from a service type object.",
  "frontend/src/utils/escPosFormatter.ts": "Formats invoice data into ESC/POS-compatible plain-text receipt layouts for both 58mm (32-char wide) and 80mm (48-char wide) thermal printers, including customer details, services, and cost breakdown.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a branded HTML invoice for FUSION GEAR and triggers a browser print dialog to produce a PDF, including customer/bike details, service list, and cost totals.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining a dark mechanical theme with custom colors (garage, amber, whatsapp), custom fonts (Rajdhani, Inter), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state for FUSION GEAR, a bike garage billing Android app, including versioning, architectural notes, and a list of implemented features such as theming, customer profiles, billing, PDF generation, and Bluetooth printing."
}